app/controllers/podcasts_controller.rb

SELECT "podcasts".* FROM "podcasts"
---
 def index
  @podcasts = Podcast.all

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
 def show
  @podcast = Podcast.find(params[:id])

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
 def edit
  @podcast= Podcast.find(params[:id])

INSERT INTO "podcasts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "b"], ["text", "b"], ["created_at", 2016-12-02 19:52:37 UTC], ["updated_at", 2016-12-02 19:52:37 UTC]]
---
 def create
  @podcast = Podcast.new(podcast_params)
    if @podcast.save

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
 def update
  @podcast = Podcast.find(params[:id])

SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "podcasts" WHERE "podcasts"."id" = $1  [["id", 1]]
---
 def destroy
  @podcast = Podcast.find(params[:id])
  @podcast.destroy