app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics" ORDER BY created_at DESC
---
 def index
  @topics = Topic.all